zlgopen/ametal/soc/hdsc/drivers/include/tim/hw/amhw_hc32f460_timea.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief 定时器TIM接口
 *
 * \internal
 * \par History
 * - 1.00 
 * \endinternal
 */

#ifndef __AMHW_HC32F460_TIMEA_H
#define __AMHW_HC32F460_TIMEA_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_types.h"
#include "am_bitops.h"


/**
 *******************************************************************************
 ** \brief Timer0 counter mode enumeration
 **
 ******************************************************************************/

#define TMRA_OVF   (1 << 0)
#define TMRA_UDF   (1 << 1)
#define TMRA_CMP   (1 << 2)
 
/**
 * \brief 定时器类型
 */
typedef enum amhw_hc32f460_timea_type {
    AMHW_HC32F460_TIMEA_TYPE_TIM0 = 0,  /**< \brief TIM0 */
    AMHW_HC32F460_TIMEA_TYPE_TIM1,      /**< \brief TIM1 */
    AMHW_HC32F460_TIMEA_TYPE_TIM2,      /**< \brief TIM2 */
    AMHW_HC32F460_TIMEA_TYPE_TIM3,      /**< \brief TIM3 */
} amhw_hc32f460_timea_type_t;


typedef enum timea_counter_mode
{
    timea_count_mode_sawtooth_wave   = 0u, 
    timea_count_mode_triangular_wave = 1u, 
}timea_counter_mode_t;

typedef enum timea_count_dir
{
    timea_count_dir_down = 0u,            
    timea_count_dir_up   = 1u,            
} timea_count_dir_t;

typedef enum timea_irq_type
{
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH1 = 0u,               
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH2 = 1u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH3 = 2u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH4 = 3u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH5 = 4u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH6 = 5u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH7 = 6u,              
    TIMERA_IRQ_CAPTURE_OR_COMPARE_CH8 = 7u,              
    TIMERA_IRQ_OVERFLOW               = 8u,              
    TIMERA_IRQ_UNDERFLOW              = 9u,              
} timea_irq_type_t;

/******************************************************************************/
typedef enum timera_flag_type
{
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH1 = 0u,              
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH2 = 1u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH3 = 2u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH4 = 3u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH5 = 4u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH6 = 5u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH7 = 6u,             
    TIMEA_FLAG_CAPTURE_OR_COMPARE_CH8 = 7u,             
    TIMEA_FLAG_OVERFLOW               = 8u,             
    TIMEA_FLAG_UNDERFLOW              = 9u,             
} timea_flag_type_t;

typedef struct
{
    __IO uint32_t CNT                       :16;
    uint32_t RESERVED16                     :16;
} stc_tmra_cnter_field_t;

typedef struct
{
    __IO uint32_t PER                       :16;
    uint32_t RESERVED16                     :16;
} stc_tmra_perar_field_t;

typedef struct
{
    __IO uint32_t CMP                       :16;
    uint32_t RESERVED16                     :16;
} stc_tmra_cmpar_field_t;

typedef struct
{
    __IO uint32_t START                     : 1;
    __IO uint32_t DIR                       : 1;
    __IO uint32_t MODE                      : 1;
    __IO uint32_t SYNST                     : 1;
    __IO uint32_t CKDIV                     : 4;
    uint32_t RESERVED8                      : 4;
    __IO uint32_t ITENOVF                   : 1;
    __IO uint32_t ITENUDF                   : 1;
    __IO uint32_t OVFF                      : 1;
    __IO uint32_t UDFF                      : 1;
    uint32_t RESERVED16                     :16;
} stc_tmra_bcstr_field_t;

typedef struct
{
    __IO uint32_t HSTA0                     : 1;
    __IO uint32_t HSTA1                     : 1;
    __IO uint32_t HSTA2                     : 1;
    uint32_t RESERVED3                      : 1;
    __IO uint32_t HSTP0                     : 1;
    __IO uint32_t HSTP1                     : 1;
    __IO uint32_t HSTP2                     : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t HCLE0                     : 1;
    __IO uint32_t HCLE1                     : 1;
    __IO uint32_t HCLE2                     : 1;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t HCLE3                     : 1;
    __IO uint32_t HCLE4                     : 1;
    __IO uint32_t HCLE5                     : 1;
    __IO uint32_t HCLE6                     : 1;
    uint32_t RESERVED16                     :16;
} stc_tmra_hconr_field_t;

typedef struct
{
    __IO uint32_t HCUP0                     : 1;
    __IO uint32_t HCUP1                     : 1;
    __IO uint32_t HCUP2                     : 1;
    __IO uint32_t HCUP3                     : 1;
    __IO uint32_t HCUP4                     : 1;
    __IO uint32_t HCUP5                     : 1;
    __IO uint32_t HCUP6                     : 1;
    __IO uint32_t HCUP7                     : 1;
    __IO uint32_t HCUP8                     : 1;
    __IO uint32_t HCUP9                     : 1;
    __IO uint32_t HCUP10                    : 1;
    __IO uint32_t HCUP11                    : 1;
    __IO uint32_t HCUP12                    : 1;
    uint32_t RESERVED13                     :19;
} stc_tmra_hcupr_field_t;

typedef struct
{
    __IO uint32_t HCDO0                     : 1;
    __IO uint32_t HCDO1                     : 1;
    __IO uint32_t HCDO2                     : 1;
    __IO uint32_t HCDO3                     : 1;
    __IO uint32_t HCDO4                     : 1;
    __IO uint32_t HCDO5                     : 1;
    __IO uint32_t HCDO6                     : 1;
    __IO uint32_t HCDO7                     : 1;
    __IO uint32_t HCDO8                     : 1;
    __IO uint32_t HCDO9                     : 1;
    __IO uint32_t HCDO10                    : 1;
    __IO uint32_t HCDO11                    : 1;
    __IO uint32_t HCDO12                    : 1;
    uint32_t RESERVED13                     :19;
} stc_tmra_hcdor_field_t;

typedef struct
{
    __IO uint32_t ITEN1                     : 1;
    __IO uint32_t ITEN2                     : 1;
    __IO uint32_t ITEN3                     : 1;
    __IO uint32_t ITEN4                     : 1;
    __IO uint32_t ITEN5                     : 1;
    __IO uint32_t ITEN6                     : 1;
    __IO uint32_t ITEN7                     : 1;
    __IO uint32_t ITEN8                     : 1;
    uint32_t RESERVED8                      :24;
} stc_tmra_iconr_field_t;

typedef struct
{
    __IO uint32_t ETEN1                     : 1;
    __IO uint32_t ETEN2                     : 1;
    __IO uint32_t ETEN3                     : 1;
    __IO uint32_t ETEN4                     : 1;
    __IO uint32_t ETEN5                     : 1;
    __IO uint32_t ETEN6                     : 1;
    __IO uint32_t ETEN7                     : 1;
    __IO uint32_t ETEN8                     : 1;
    uint32_t RESERVED8                      :24;
} stc_tmra_econr_field_t;

typedef struct
{
    __IO uint32_t NOFIENTG                  : 1;
    __IO uint32_t NOFICKTG                  : 2;
    uint32_t RESERVED3                      : 5;
    __IO uint32_t NOFIENCA                  : 1;
    __IO uint32_t NOFICKCA                  : 2;
    uint32_t RESERVED11                     : 1;
    __IO uint32_t NOFIENCB                  : 1;
    __IO uint32_t NOFICKCB                  : 2;
    uint32_t RESERVED15                     :17;
} stc_tmra_fconr_field_t;

typedef struct
{
    __IO uint32_t CMPF1                     : 1;
    __IO uint32_t CMPF2                     : 1;
    __IO uint32_t CMPF3                     : 1;
    __IO uint32_t CMPF4                     : 1;
    __IO uint32_t CMPF5                     : 1;
    __IO uint32_t CMPF6                     : 1;
    __IO uint32_t CMPF7                     : 1;
    __IO uint32_t CMPF8                     : 1;
    uint32_t RESERVED8                      :24;
} stc_tmra_stflr_field_t;

typedef struct
{
    __IO uint32_t BEN                       : 1;
    __IO uint32_t BSE0                      : 1;
    __IO uint32_t BSE1                      : 1;
    uint32_t RESERVED3                      :29;
} stc_tmra_bconr_field_t;


typedef struct
{
    __IO uint32_t CAPMDA                    : 1;
    uint32_t RESERVED1                      : 3;
    __IO uint32_t HICP0                     : 1;
    __IO uint32_t HICP1                     : 1;
    __IO uint32_t HICP2                     : 1;
    uint32_t RESERVED7                      : 1;
    __IO uint32_t HICP3                     : 1;
    __IO uint32_t HICP4                     : 1;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t NOFIENCP                  : 1;
    __IO uint32_t NOFICKCP                  : 2;
    uint32_t RESERVED15                     :17;
} stc_tmra_cconr_field_t;

typedef struct
{
    __IO uint32_t STAC                      : 2;
    __IO uint32_t STPC                      : 2;
    __IO uint32_t CMPC                      : 2;
    __IO uint32_t PERC                      : 2;
    __IO uint32_t FORC                      : 2;
    uint32_t RESERVED10                     : 2;
    __IO uint32_t OUTEN                     : 1;
    uint32_t RESERVED13                     :19;
} stc_tmra_pconr_field_t;


typedef struct
{
    union
    {
        __IO uint32_t CNTER;
        stc_tmra_cnter_field_t CNTER_f;
    };
    union
    {
        __IO uint32_t PERAR;
        stc_tmra_perar_field_t PERAR_f;
    };
    uint8_t RESERVED2[56];
    union
    {
        __IO uint32_t CMPAR1;
        stc_tmra_cmpar_field_t CMPAR1_f;
    };
    union
    {
        __IO uint32_t CMPAR2;
        stc_tmra_cmpar_field_t CMPAR2_f;
    };
    union
    {
        __IO uint32_t CMPAR3;
        stc_tmra_cmpar_field_t CMPAR3_f;
    };
    union
    {
        __IO uint32_t CMPAR4;
        stc_tmra_cmpar_field_t CMPAR4_f;
    };
    union
    {
        __IO uint32_t CMPAR5;
        stc_tmra_cmpar_field_t CMPAR5_f;
    };
    union
    {
        __IO uint32_t CMPAR6;
        stc_tmra_cmpar_field_t CMPAR6_f;
    };
    union
    {
        __IO uint32_t CMPAR7;
        stc_tmra_cmpar_field_t CMPAR7_f;
    };
    union
    {
        __IO uint32_t CMPAR8;
        stc_tmra_cmpar_field_t CMPAR8_f;
    };
    uint8_t RESERVED10[32];
    union
    {
        __IO uint32_t BCSTR;
        stc_tmra_bcstr_field_t BCSTR_f;
    };
    union
    {
        __IO uint32_t HCONR;
        stc_tmra_hconr_field_t HCONR_f;
    };
    union
    {
        __IO uint32_t HCUPR;
        stc_tmra_hcupr_field_t HCUPR_f;
    };
    union
    {
        __IO uint32_t HCDOR;
        stc_tmra_hcdor_field_t HCDOR_f;
    };
    union
    {
        __IO uint32_t ICONR;
        stc_tmra_iconr_field_t ICONR_f;
    };
    union
    {
        __IO uint32_t ECONR;
        stc_tmra_econr_field_t ECONR_f;
    };
    union
    {
        __IO uint32_t FCONR;
        stc_tmra_fconr_field_t FCONR_f;
    };
    union
    {
        __IO uint32_t STFLR;
        stc_tmra_stflr_field_t STFLR_f;
    };
    uint8_t RESERVED18[32];
    union
    {
        __IO uint32_t BCONR1;
        stc_tmra_bconr_field_t BCONR1_f;
    };
    uint8_t RESERVED19[4];
    union
    {
        __IO uint32_t BCONR2;
        stc_tmra_bconr_field_t BCONR2_f;
    };
    uint8_t RESERVED20[4];
    union
    {
        __IO uint32_t BCONR3;
        stc_tmra_bconr_field_t BCONR3_f;
    };
    uint8_t RESERVED21[4];
    union
    {
        __IO uint32_t BCONR4;
        stc_tmra_bconr_field_t BCONR4_f;
    };
    uint8_t RESERVED22[36];
    union
    {
        __IO uint32_t CCONR1;
        stc_tmra_cconr_field_t CCONR1_f;
    };
    union
    {
        __IO uint32_t CCONR2;
        stc_tmra_cconr_field_t CCONR2_f;
    };
    union
    {
        __IO uint32_t CCONR3;
        stc_tmra_cconr_field_t CCONR3_f;
    };
    union
    {
        __IO uint32_t CCONR4;
        stc_tmra_cconr_field_t CCONR4_f;
    };
    union
    {
        __IO uint32_t CCONR5;
        stc_tmra_cconr_field_t CCONR5_f;
    };
    union
    {
        __IO uint32_t CCONR6;
        stc_tmra_cconr_field_t CCONR6_f;
    };
    union
    {
        __IO uint32_t CCONR7;
        stc_tmra_cconr_field_t CCONR7_f;
    };
    union
    {
        __IO uint32_t CCONR8;
        stc_tmra_cconr_field_t CCONR8_f;
    };
    uint8_t RESERVED30[32];
    union
    {
        __IO uint32_t PCONR1;
        stc_tmra_pconr_field_t PCONR1_f;
    };
    union
    {
        __IO uint32_t PCONR2;
        stc_tmra_pconr_field_t PCONR2_f;
    };
    union
    {
        __IO uint32_t PCONR3;
        stc_tmra_pconr_field_t PCONR3_f;
    };
    union
    {
        __IO uint32_t PCONR4;
        stc_tmra_pconr_field_t PCONR4_f;
    };
    union
    {
        __IO uint32_t PCONR5;
        stc_tmra_pconr_field_t PCONR5_f;
    };
    union
    {
        __IO uint32_t PCONR6;
        stc_tmra_pconr_field_t PCONR6_f;
    };
    union
    {
        __IO uint32_t PCONR7;
        stc_tmra_pconr_field_t PCONR7_f;
    };
    union
    {
        __IO uint32_t PCONR8;
        stc_tmra_pconr_field_t PCONR8_f;
    };
}amhw_hc32f460_timea_t;

typedef enum timea_channel
{
    TIMERA_CH1 = 0U,                      
    TIMERA_CH2 = 1U,                     
    TIMERA_CH3 = 2U,                     
    TIMERA_CH4 = 3U,                     
    TIMERA_CH5 = 4U,                     
    TIMERA_CH6 = 5U,                     
    TIMERA_CH7 = 6U,                     
    TIMERA_CH8 = 7U,                   
} timea_channel_t;

typedef enum en_timera_count_start_output
{
    TimeraCountStartOutputLow  = 0u,                ///< TIMA_<t>_PWMn port output low level
    TimeraCountStartOutputHigh = 1u,                ///< TIMA_<t>_PWMn port output high level
    TimeraCountStartOutputKeep = 2u,                ///< TIMA_<t>_PWMn port output to keep
} en_timera_count_start_output_t;

typedef enum en_timera_count_stop_output
{
    TimeraCountStopOutputLow  = 0u,                 ///< TIMA_<t>_PWMn port output low level
    TimeraCountStopOutputHigh = 1u,                 ///< TIMA_<t>_PWMn port output high level
    TimeraCountStopOutputKeep = 2u,                 ///< TIMA_<t>_PWMn port output to keep
} en_timera_count_stop_output_t;

typedef enum en_timera_compare_match_output
{
    TimeraCompareMatchOutputLow     = 0u,           ///< TIMA_<t>_PWMn port output low level
    TimeraCompareMatchOutputHigh    = 1u,           ///< TIMA_<t>_PWMn port output high level
    TimeraCompareMatchOutputKeep    = 2u,           ///< TIMA_<t>_PWMn port output to keep
    TimeraCompareMatchOutputReverse = 3u,           ///< TIMA_<t>_PWMn port output reverse
} en_timera_compare_match_output_t;

typedef enum en_timera_period_match_output
{
    TimeraPeriodMatchOutputLow     = 0u,            ///< TIMA_<t>_PWMn port output low level
    TimeraPeriodMatchOutputHigh    = 1u,            ///< TIMA_<t>_PWMn port output high level
    TimeraPeriodMatchOutputKeep    = 2u,            ///< TIMA_<t>_PWMn port output to keep
    TimeraPeriodMatchOutputReverse = 3u,            ///< TIMA_<t>_PWMn port output reverse
} en_timera_period_match_output_t;

typedef enum en_timera_specify_output
{
    TimeraSpecifyOutputInvalid = 0u,                ///< TIMA_<t>_PWMn port output invalid
    TimeraSpecifyOutputLow     = 2u,                ///< TIMA_<t>_PWMn port output low level from next period
    TimeraSpecifyOutputHigh    = 3u,                ///< TIMA_<t>_PWMn port output high level from next period
} en_timera_specify_output_t;

