zlgopen/ametal/soc/hdsc/drivers/include/tim/hw/amhw_hc32f460_timea.h
}

/**
 * \brief CTEN 定时器使能
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \note 定时器不同模式的选择控制位固定，再根据联合体结构的特性，只对某一寄存器操作即可。
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_timea_enable (amhw_hc32f460_timea_t *p_hw_tim, uint8_t chan)
{
    p_hw_tim->BCSTR_f.START = 1;
}

/**
 * \brief 内部时钟分频选择
 */
typedef enum {
    AMHW_HC32F460_TIMEA_CLK_DIV0 = 0,    /* 1分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV2,        /* 2分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV4,        /* 4分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV8,        /* 8分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV16,       /* 16分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV32,       /* 32分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV64,       /* 64分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV128,      /* 128分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV256,      /* 256分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV512,      /* 512分频 */
    AMHW_HC32F460_TIMEA_CLK_DIV1024,     /* 1024分频 */
}amhw_hc32f460_timea_clkdiv_t;

/**
 * \brief PRS 内部时钟分频选择   获取
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \return 设置的分频系数（amhw_hc32f460_timea_clkdiv_t枚举量）
 */
am_static_inline
amhw_hc32f460_timea_clkdiv_t
    amhw_hc32f460_timea_mode_clkdiv_get (amhw_hc32f460_timea_t *p_hw_tim, uint8_t chan)
{
    amhw_hc32f460_timea_clkdiv_t clkdiv;
    clkdiv = p_hw_tim->BCSTR_f.CKDIV;
    return clkdiv;
}

/**
 * \brief PRS 内部时钟分频选择   设置
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 * \param[in] clkdiv   : 设置的分频系数（amhw_hc32f460_timea_clkdiv_t枚举量）
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_timea_mode_clkdiv_set (amhw_hc32f460_timea_t       *p_hw_tim,
                                      uint8_t  chan, 
                                      amhw_hc32f460_timea_clkdiv_t clkdiv)
{
    p_hw_tim->BCSTR_f.CKDIV = clkdiv;
}

/******************************************************************************/
/***************************Timer模式0控制寄存器     相关控制函数**************************/
/******************************************************************************/

/**
 * \brief UIE 中断禁能
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_timea_int_disable (amhw_hc32f460_timea_t *p_hw_tim, timea_irq_type_t irq)
{
    switch (irq)
    {
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH1:
            p_hw_tim->ICONR_f.ITEN1 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH2:
            p_hw_tim->ICONR_f.ITEN2 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH3:
            p_hw_tim->ICONR_f.ITEN3 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH4:
            p_hw_tim->ICONR_f.ITEN4 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH5:
            p_hw_tim->ICONR_f.ITEN5 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH6:
            p_hw_tim->ICONR_f.ITEN6 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH7:
            p_hw_tim->ICONR_f.ITEN7 = 0;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH8:
            p_hw_tim->ICONR_f.ITEN8 = 0;
            break;
        case TIMERA_IRQ_OVERFLOW:
            p_hw_tim->BCSTR_f.ITENOVF = 0;
            break;
        case TIMERA_IRQ_UNDERFLOW:
            p_hw_tim->BCSTR_f.ITENUDF = 0;
            break;
        default:
            break;
    }
}

/**
 * \brief UIE 中断使能
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_timea_int_enable (amhw_hc32f460_timea_t *p_hw_tim, timea_irq_type_t irq)
{
    switch (irq)
    {
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH1:
            p_hw_tim->ICONR_f.ITEN1 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH2:
            p_hw_tim->ICONR_f.ITEN2 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH3:
            p_hw_tim->ICONR_f.ITEN3 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH4:
            p_hw_tim->ICONR_f.ITEN4 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH5:
            p_hw_tim->ICONR_f.ITEN5 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH6:
            p_hw_tim->ICONR_f.ITEN6 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH7:
            p_hw_tim->ICONR_f.ITEN7 = 1;
            break;
        case TIMERA_IRQ_CAPTURE_OR_COMPARE_CH8:
            p_hw_tim->ICONR_f.ITEN8 = 1;
            break;
        case TIMERA_IRQ_OVERFLOW:
            p_hw_tim->BCSTR_f.ITENOVF = 1;
            break;
        case TIMERA_IRQ_UNDERFLOW:
            p_hw_tim->BCSTR_f.ITENUDF = 1;
            break;
        default:
            break;
    }

}


/**
 * \brief UIF 溢出中断 标志获取
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \return AM_TRUE  ： 标志有效
 *         AM_FALSE ： 标志无效
 */
am_static_inline
am_bool_t amhw_hc32f460_timea_int_flag_check(amhw_hc32f460_timea_t *p_hw_tim, timea_flag_type_t flag)
{
//    return (p_hw_tim->ifr & 0x1ul) ? AM_TRUE : AM_FALSE;
    uint8_t value = 0;
    if(TIMEA_FLAG_CAPTURE_OR_COMPARE_CH1 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF1;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH2 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF2;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH3 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF3;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH4 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF4;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH5 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF5;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH6 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF6;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH7 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF7;
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH8 == flag)
    {
        value = p_hw_tim->STFLR_f.CMPF8;
    }else if (TIMEA_FLAG_OVERFLOW == flag)
    {
        value = p_hw_tim->BCSTR_f.OVFF;
    }else if (TIMEA_FLAG_UNDERFLOW == flag)
    {
        value = p_hw_tim->BCSTR_f.UDFF;
    } else {
        ;
    }
    return value ? AM_TRUE : AM_FALSE;
}

/**
 * \brief UIF 溢出中断 标志清除
 *
 * \param[in] p_hw_tim : 指向TIM定时器寄存器块的指针
 *
 * \return 无
 */
am_static_inline
void amhw_hc32f460_timea_int_flag_clr(amhw_hc32f460_timea_t *p_hw_tim, timea_flag_type_t flag)
{
    if(TIMEA_FLAG_CAPTURE_OR_COMPARE_CH1 == flag)
    {
        p_hw_tim->STFLR_f.CMPF1 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH2 == flag)
    {
        p_hw_tim->STFLR_f.CMPF2 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH3 == flag)
    {
        p_hw_tim->STFLR_f.CMPF3 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH4 == flag)
    {
        p_hw_tim->STFLR_f.CMPF4 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH5 == flag)
    {
        p_hw_tim->STFLR_f.CMPF5 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH6 == flag)
    {
        p_hw_tim->STFLR_f.CMPF6 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH7 == flag)
    {
        p_hw_tim->STFLR_f.CMPF7 = 0;        
    } else if (TIMEA_FLAG_CAPTURE_OR_COMPARE_CH8 == flag)
    {
        p_hw_tim->STFLR_f.CMPF8 = 0;        
    }else if (TIMEA_FLAG_OVERFLOW == flag)
    {
        p_hw_tim->BCSTR_f.OVFF = 0;
    }else if (TIMEA_FLAG_UNDERFLOW == flag)
    {
        p_hw_tim->BCSTR_f.UDFF = 0;
    } else {
        ;
    }
}

am_static_inline
void amhw_hc32f460_timea_int_all_flag_clr(amhw_hc32f460_timea_t *p_hw_tim)
{
    p_hw_tim->STFLR_f.CMPF1 = 0;        
    p_hw_tim->STFLR_f.CMPF2 = 0;   
    p_hw_tim->STFLR_f.CMPF3 = 0;        
    p_hw_tim->STFLR_f.CMPF4 = 0;        
    p_hw_tim->STFLR_f.CMPF5 = 0;        
    p_hw_tim->STFLR_f.CMPF6 = 0;        
    p_hw_tim->STFLR_f.CMPF7 = 0;        
    p_hw_tim->STFLR_f.CMPF8 = 0;        

    p_hw_tim->BCSTR_f.OVFF = 0;
    p_hw_tim->BCSTR_f.UDFF = 0;
}


am_static_inline
uint16_t amhw_hc32f460_timea_get_compare_value(amhw_hc32f460_timea_t *p_hw_tim, timea_channel_t enChannel)
{
    uint16_t u16CompareVal = 0u;
    __IO stc_tmra_cmpar_field_t *pstcTimeraCompare;

    pstcTimeraCompare = (stc_tmra_cmpar_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->CMPAR1, enChannel);
    u16CompareVal = (uint16_t)pstcTimeraCompare->CMP;

    return u16CompareVal;
}

am_static_inline
am_bool_t amhw_hc32f460_timea_compare_init(amhw_hc32f460_timea_t *p_hw_tim, timea_channel_t enChannel,
                               const stc_timera_compare_init_t *pstcCompareInit)
{
    am_bool_t enRet = AM_FALSE;
    __IO stc_tmra_pconr_field_t *pstcTimeraPort;
    __IO stc_tmra_bconr_field_t *pstcTimeraCache;
    __IO stc_tmra_cmpar_field_t *pstcTimeraCompare;
    __IO stc_tmra_cconr_field_t *pstcTimeraCapture;

    /* Check parameters */
    if((NULL != p_hw_tim) && (NULL != pstcCompareInit))
    {
        /* Configure port control register */
        pstcTimeraPort = (stc_tmra_pconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->PCONR1, enChannel);
        pstcTimeraPort->STAC = pstcCompareInit->enStartCountOutput;
        pstcTimeraPort->STPC = pstcCompareInit->enStopCountOutput;
        pstcTimeraPort->CMPC = pstcCompareInit->enCompareMatchOutput;
        pstcTimeraPort->PERC = pstcCompareInit->enPeriodMatchOutput;
        pstcTimeraPort->FORC = pstcCompareInit->enSpecifyOutput;

        /* Configure cache control register */
        if ((TIMERA_CH1 == enChannel) || (TIMERA_CH3 == enChannel) ||
            (TIMERA_CH5 == enChannel) || (TIMERA_CH7 == enChannel))
        {
            pstcTimeraCache = (stc_tmra_bconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->BCONR1, enChannel);
            pstcTimeraCache->BSE0 = pstcCompareInit->enTriangularCrestTransEn;
            pstcTimeraCache->BSE1 = pstcCompareInit->enTriangularTroughTransEn;
            pstcTimeraCache->BEN = pstcCompareInit->enCacheEn;
            /* Configure compare cache value register */
            pstcTimeraCompare = (stc_tmra_cmpar_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->CMPAR1, enChannel + 1);
            pstcTimeraCompare->CMP = pstcCompareInit->u16CompareCacheVal;
        }

