zlgopen/ametal/soc/hdsc/drivers/include/tim/hw/amhw_hc32f460_timea.h
        /* Configure compare value register */
        pstcTimeraCompare = (stc_tmra_cmpar_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->CMPAR1, enChannel);
        pstcTimeraCompare->CMP = pstcCompareInit->u16CompareVal;

        /* Set compare output function */
        pstcTimeraCapture = (stc_tmra_cconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->CCONR1, enChannel);
        pstcTimeraCapture->CAPMDA = 0u;
        enRet = AM_TRUE;
    }

    return enRet;
}

am_static_inline
am_bool_t  amhw_hc32f460_timea_compare_cmd(amhw_hc32f460_timea_t *p_hw_tim, timea_channel_t enChannel,
                              en_functional_state_t enNewSta)
{
    am_bool_t enRet = AM_FALSE;
    __IO stc_tmra_pconr_field_t *pstcTimeraPort;

    pstcTimeraPort = (stc_tmra_pconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->PCONR1, enChannel);
    pstcTimeraPort->OUTEN = enNewSta;
    enRet = AM_TRUE;
    return enRet;
}

am_static_inline
am_bool_t amhw_hc32f460_timea_capture_init(amhw_hc32f460_timea_t *p_hw_tim, timea_channel_t enChannel,
                               const stc_timera_capture_init_t *pstcCapInit)
{
    am_bool_t enRet = AM_FALSE;
    __IO stc_tmra_cconr_field_t *pstcTimeraCapture;

    /* Check parameters */
    if((NULL != p_hw_tim) && (NULL != pstcCapInit))
    {
        /* Configure capture control register */
        pstcTimeraCapture = (stc_tmra_cconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->CCONR1, enChannel);
        pstcTimeraCapture->HICP0 = pstcCapInit->enCapturePwmRisingEn;
        pstcTimeraCapture->HICP1 = pstcCapInit->enCapturePwmFallingEn;
        pstcTimeraCapture->HICP2 = pstcCapInit->enCaptureSpecifyEventEn;
        pstcTimeraCapture->NOFICKCP = pstcCapInit->enPwmClkDiv;
        pstcTimeraCapture->NOFIENCP = pstcCapInit->enPwmFilterEn;

        /* TIMA_<t>_TRIG port capture function only valid for TimeraCh4 */
        if (TIMERA_CH4 == enChannel)
        {
            pstcTimeraCapture->HICP3 = pstcCapInit->enCaptureTrigRisingEn;
            pstcTimeraCapture->HICP4 = pstcCapInit->enCaptureTrigFallingEn;
            /* Configure filter control register */
            p_hw_tim->FCONR_f.NOFICKTG = pstcCapInit->enTrigClkDiv;
            p_hw_tim->FCONR_f.NOFIENTG = pstcCapInit->enTrigFilterEn;
        }

        /* Set capture input function */
        pstcTimeraCapture->CAPMDA = 1u;
        enRet = AM_TRUE;
    }

    return enRet;
}                               


am_static_inline
am_bool_t  amhw_hc32f460_timea_compare_cache_cmd(amhw_hc32f460_timea_t *p_hw_tim, timea_channel_t enChannel,
                                   en_functional_state_t enNewSta)
{
    /*attention: enChannel must TimeraCh1 TimeraCh3 TimeraCh5 TimeraCh7*/
    am_bool_t enRet = AM_FALSE;
    __IO stc_tmra_bconr_field_t *pstcTimeraCache;

    if (TIMERA_CH1 == enChannel || TIMERA_CH3 == enChannel || TIMERA_CH5 == enChannel || TIMERA_CH7 == enChannel)
    {
        /* Configure cache control register */
        pstcTimeraCache = (stc_tmra_bconr_field_t *)TIMERA_CALC_REG_ADDR(p_hw_tim->BCONR1, enChannel);
        pstcTimeraCache->BEN = enNewSta;
        enRet = AM_TRUE;
    }

    return enRet;
}

/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /* __AMHW_HC32F460_TIMEA_H */

/* end of file */
